import os

os.environ["OPENBLAS_NUM_THREADS"] = "1"

if __name__ == "__main__":
    n = int(input())

    matrica = [[i for i in input().split()] for j in range(n)]

    # kvadratna_matrica = [[x for x in red] for red in matrica]

    poKomshiskaLinija = [(-1, -1), (-1, 0), (-1, 1),
                         (0, -1), (0, 1),
                         (1, -1), (1, 0), (1, 1)]

    for i in range(n):
        for j in range(n):

            if matrica[i][j] == '#':
                matrica[i][j] = '#'

            else:
                brojac = 0

                for komshiI, komhsiJ in poKomshiskaLinija:
                    kI = komshiI + i
                    kJ = komhsiJ + j
                    if 0 <= kI < n and 0 <= kJ < n and matrica[kI][kJ] == '#':
                        brojac += 1

                matrica[i][j]=brojac


    for red in matrica:
            # print("   ".join(red))
        print(*red, sep="   ")
            # * za da gi nema [] , ''
            # sep="" spaces separator



"""
Овој проблем се базира на играта Minesweeper.

Креирајте функција која како влез зема листа од # и -, каде што секој хаш знак (#) претставува 
мина, а секоја цртичка (-) претставува поле без мина. Функцијата треба да враќа листа каде што 
секоја цртичка е заменета со бројка која го претставува бројот на мини од најблиските полиња на 
моменталното поле (хоризонтално, вертикално, и дијагонално). Листата која се враќа на излез креирајте 
ја со пристапот list comprehension.

Од стандарден влез е дадена големината на полето N (полето е со димензии NxN), како и 
репрезентацијата на полето со # и -. Потребно е да направите репрезентација на полето 
преку листа од листи, каде што елементите се # и -. Оваа листа е влез на претходно 
дефинираната функција, а излезот од функцијата е потребно да се испечати од стандарден влез.

Помош: влезот е зададен ред по ред за секоја редица во полето, додека индивидуалните елементи 
се одвоени со 3 празни места. За да се одделат елементите со 3 празни места, може да ја 
искористите функцијата split() дефинирана на стрингови. За печатење на излезот може да ја 
користите функцијата join() дефинирана на стрингови.
"""
