"""
Задача 1
Напишете програма која бара од корисникот да внесе име и години 
и потоа пресметува во која година тој ќе има 100 години. Испечатете го 
неговото име и годината добиена.
"""

if __name__ == '__main__':
    ime, godini = input(), float(input())
    rez=(2025 + (100 - godini))
    print(ime + " ke ima 100 godini vo " + rez)
